machine learning modle bnayenge to nhi chahenge ki missing data ke sath kaam kre 
isliye  finding  -> remove -> replace 

niche wale chize actual me data me changes nhi krenge qki iske liye  comma [,] lga ke inplace  true likhna hoga

In [2]:
import pandas as pd
import numpy as np

In [9]:
data = {
    'A' : [1,2,np.nan , 4,5],
    'B' : [np.nan,2,3 , 4,5],
    'C' : [1,2,np.nan , np.nan,5],
    'D' : [1,np.nan, np.nan,np.nan,5],

}
df = pd.DataFrame(data)

In [11]:
# jha jha null waha true vvalue 
df.isna()

       A      B      C      D
0  False   True  False  False
1  False  False  False   True
2   True  False   True   True
3  False  False   True   True
4  False  False  False  False

In [13]:
# count number of  null in each column 
df.isna().sum()

A    1
B    1
C    2
D    3
dtype: int64

In [15]:
# jaha jaha null hoga wahi true 
df.isna().any()

A    True
B    True
C    True
D    True
dtype: bool

In [22]:
# remove the null value wal row 
df.dropna()

     A    B    C    D
4  5.0  5.0  5.0  5.0

In [25]:
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  NaN  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  5.0  5.0

In [40]:
#thresoled 


# means remove all the row jisme minimum thresold jitna non null value n ho 

df.dropna(thresh=4)

     A    B    C    D
4  5.0  5.0  5.0  5.0

In [42]:
df.fillna(0)

     A    B    C    D
0  1.0  0.0  1.0  1.0
1  2.0  2.0  2.0  0.0
2  0.0  3.0  0.0  0.0
3  4.0  4.0  0.0  0.0
4  5.0  5.0  5.0  5.0

yah drop row wise hota hai 
fill krna ho to column wise krte hai

In [ ]:
# ab null value dirent diferent column me aane pr diferent diferernt value fill krna list ka 
# 
values = {'A':0 , 'B':100 , 'C':300 , 'D':400}
df.fillna(value = values)

     A      B      C      D
0  1.0  100.0    1.0    1.0
1  2.0    2.0    2.0  400.0
2  0.0    3.0  300.0  400.0
3  4.0    4.0  300.0  400.0
4  5.0    5.0    5.0    5.0

In [46]:
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  NaN  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  5.0  5.0

In [45]:
df.fillna(df.mean())

     A    B         C    D
0  1.0  3.5  1.000000  1.0
1  2.0  2.0  2.000000  3.0
2  3.0  3.0  2.666667  3.0
3  4.0  4.0  2.666667  3.0
4  5.0  5.0  5.000000  5.0